READ.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>READ</title>
<!-- 2017-03-24 Fri 18:20 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Eugene Tryfonides" />
</head>
<body>
<div id="content">
<h1 class="title">READ</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">SUBJECT - Apache2 Server on Unix</a>
<ul>
<li><a href="#sec-1-1">Επεξεργαστήτε αυτά τα αρχεία στο με ένα οποιοδήποτε editor πχ nano προτεινόμενο το emacs</a>
<ul>
<li><a href="#sec-1-1-1">file: /etc/networks/interfaces</a></li>
<li><a href="#sec-1-1-2">file: /etc/apache2/apache.conf</a></li>
<li><a href="#sec-1-1-3">file: /etc/apache2/ports</a></li>
<li><a href="#sec-1-1-4">file: /etc/apache2/site-enable/000-default</a></li>
</ul>
</li>
<li><a href="#sec-1-2">Στο τερματικό σας</a>
<ul>
<li><a href="#sec-1-2-1">enable site</a></li>
<li><a href="#sec-1-2-2">Αν δεν έχετε φάκελο html στον <i>var/www</i>  φάκελο τότε φτιάξτε ένα με</a></li>
<li><a href="#sec-1-2-3">δώστε πρόσβαση στους χρήστες με την εντολη</a></li>
<li><a href="#sec-1-2-4">change the file owner and group</a></li>
<li><a href="#sec-1-2-5">RESTART SERVER</a></li>
</ul>
</li>
<li><a href="#sec-1-3">Tips (help with terminal)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">SUBJECT - Apache2 Server on Unix</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Επεξεργαστήτε αυτά τα αρχεία στο με ένα οποιοδήποτε editor πχ nano προτεινόμενο το emacs</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">file: <a href="file:///etc/networks/interfaces">/etc/networks/interfaces</a></h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
auto eth0
iface eth0 inet static
      address 192.168.2.6 
      netmask 255.255.255.0
      network 192.168.2.0
      broadcast 192.168.2.255
      gateway 192.168.2.1
      dns-nameservers 192.168.2.1
      up ethtool -s eth0 wol g
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">file: <a href="file:///etc/apache2/apache2.conf">/etc/apache2/apache.conf</a></h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>Κοιτάξτε μέσα στο αρχείο με το emacs σας με Κοντρόλ+χ Κοντρόλ-f ανοίγετε το αρχείο.
</li>
</ul>
<p>
Αντικαταστήστε στην πρώτη γραμμή το ServerName 192.168.2.6 με το δικό σας ip.
</p>

<ul class="org-ul">
<li>Αν θέλετε ο κάθε χρήστης να έχει την δική του ιστιοσελίδα τότε προσθέστε UserDir public<sub>html</sub>
</li>
</ul>
<p>
και κάντε ένα φάκελο public<sub>html</sub> για κάθε χρήστη. 
</p>
<ul class="org-ul">
<li>Σώζετε το αρχείο με Κοντρόλ και χ Κοντρόλ και s και κλείνετε το αρχείο με Κοντρόλ και χ Κοντρόλ και Κ   
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3">file: <a href="file:///etc/apache2/ports.conf">/etc/apache2/ports</a></h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li>change the NameVirtualHost *:8008 that is the port i open to the port you like 
</li>
<li>Change the Listen port also.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4">file: <a href="file:///etc/apache2/sites-enabled/000-default.conf">/etc/apache2/site-enable/000-default</a></h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
 &lt;VirtualHost *:8008&gt;
DocumentRoot /var/www/html
</p>

<p>
&lt;Directory /&gt;
    Options FollowSymLinks MultiViews
    AllowOverride All
&lt;/Directory&gt;
</p>

<p>
&lt;Directory "/var/www/html"&gt;
    Options Indexes FollowSymLinks MultiViews
    AllowOverride All
    Order allow,deny
    Allow from all
&lt;/Directory&gt;
**
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Στο τερματικό σας</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">enable site</h4>
<div class="outline-text-4" id="text-1-2-1">
<pre class="example">
a2ensite 000-default
</pre>
<p>
or
</p>
<pre class="example">
sudo a2ensite 000-default
</pre>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">Αν δεν έχετε φάκελο html στον <i>var/www</i>  φάκελο τότε φτιάξτε ένα με</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
mkdir /var/www/html
ή
sudo mkdir /var/www/html 
</p>
</div>
</div>
<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3">δώστε πρόσβαση στους χρήστες με την εντολη</h4>
<div class="outline-text-4" id="text-1-2-3">
<pre class="example">
chmod -R 755 /var/www/html
</pre>
<ul class="org-ul">
<li>4  να με αφήνει να διάβάσω
2 να με αφήνει να γράψω
1 να με αφήνει να εκτελώ
</li>
</ul>
<p>
άρα εμείς δώσαμε διάβασε γράψε εκτέλεσε στο χρήστη μετά πάει το group που δώσαμε διάβασε εκτέλεσε  4+1 και τέλος για τους υπόλοιπυς και πάλι διάβασε εκτέλεσε
στο φάκελο html. Το ίδιο και για τον φάκελο του κάθε χρήστη public<sub>html</sub>
</p>
<pre class="example">
chmod -R 755 /home/user/public_html
</pre>
</div>
</div>
<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4">change the file owner and group</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
example with the user egelor
</p>
<pre class="example">
sudo chown egelor:www-data /var/www/html
sudo chown egelor:www-data /home/egelor/public_html
</pre>
</div>
</div>
<div id="outline-container-sec-1-2-5" class="outline-4">
<h4 id="sec-1-2-5">RESTART SERVER</h4>
<div class="outline-text-4" id="text-1-2-5">
<pre class="example">
service apache2 restart
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Tips (help with terminal)</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>up arrow the previous command
</li>
</ol>
</div>
<ul class="org-ul"><li><a id="sec-1-3-0-1" name="sec-1-3-0-1"></a>if you want a better shell download zsh shell with<br  /><div class="outline-text-5" id="text-1-3-0-1">
<pre class="example">
sudo apt-get install zsh
</pre>
<ul class="org-ul">
<li>put my .zshrc which is the configuration file, inside your home folder and make zsh shell permanet shell with the command
</li>
</ul>
<pre class="example">
chsh -S $(which zsh)
</pre>
<ul class="org-ul">
<li>just write in your command line zsh
</li>
</ul>
</div>
</li>
<li><a id="sec-1-3-0-2" name="sec-1-3-0-2"></a>with TAB key the computer fills the line<br  /><div class="outline-text-5" id="text-1-3-0-2">
<p>
 example you want to go to the <i>var/www/html folder
cd /var/w TAB goes to /var/www</i> TAB shows the html folder hit ENTER
the same you can do with the commands too. 
</p>
</div>
</li>

<li><a id="sec-1-3-0-3" name="sec-1-3-0-3"></a>Usefull commands for the server<br  /><div class="outline-text-5" id="text-1-3-0-3">
<pre class="example">
sudo addgroup www-data
</pre>
<pre class="example">
sudo chown username:www-data /var/www/html
</pre>
</div>
</li></ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Eugene Tryfonides</p>
<p class="date">Created: 2017-03-24 Fri 18:20</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
